demo-output/website/dafoam/f6a_epistemic_band/channel3_eigenvalue_perturbation/twoC/system/gradU
gradU
{     
// Mandatory entries     
type            grad;     
libs            ("libfieldFunctionObjects.so");     
field           U;     

// Optional (inherited) entries     
result          gradU;     
}
